run/abl/fullScale/fullScaleTurbRefined/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontField
    {
        type            patch;
        nFaces          72;
        startFace       42828;
    }
    backField
    {
        type            patch;
        nFaces          72;
        startFace       42900;
    }
    symPlane
    {
        type            empty;
        inGroups        1(empty);
        nFaces          21600;
        startFace       42972;
    }
    sideField
    {
        type            empty;
        inGroups        1(empty);
        nFaces          21600;
        startFace       64572;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       86172;
    }
    top
    {
        type            patch;
        nFaces          300;
        startFace       86472;
    }
)

// ************************************************************************* //
