run/abl/fullScale/fullScaleTurbRefined/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontField
    {
        type            calculated;
        value           $internalField;
    }
    backField
    {
        type            calculated;
        value           $internalField;
    }
    sideField
    {
        type            empty;
    }
    top
    {
        type            calculated;
        value           $internalField;
    }
    ground
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    symPlane
    {
        type            empty;
    }
    
}
// ************************************************************************* //
