run/abl/fullScale/fullScaleTurbRefined/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "$FOAM_CASE/data/ablParams"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontField
    {   
        type            calculated;
        value           $internalField;
    }   
    backField
    {   
        type            calculated;
        value           $internalField;
    }   
    sideField
    {   
        type            empty;
    }   
    top 
    {   
        type            calculated;
        value           $internalField;
    }
    ground
    {
        type            nutkAtmRoughWallFunction;
        z0              uniform $z0;   
        value           $internalField;
    }
    symPlane
    {
        type            empty;
    }
}


// ************************************************************************* //
